stressTest/stressTest.yml
config:
  processor: './config.js'
  target: 'http://localhost:3000'
  http:
    pool: 150
  phases:
    - duration: 30
      arrivalRate: 1
      maxVusers: 1
      name: '1 user for 1 minute, warm up'
    - duration: 60
      arrivalRate: 1
      rampTo: 10
      name: "10 users for 1 min"
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "100 users for 1 min"
    - duration: 120
      arrivalRate: 100
      rampTo: 1000
      name: '1000 users for 2 min'

scenarios:
  - name: "Get items details"
    flow:
    - function: "createRandomId"
    - get:
        url: "/?={id}"
  # - name: "Create new item"
  #   weight: 2
  #   flow:
  #   - function: "createRandomItem"
  #   - post:
  #       url: "/items/"
  #       json:
  #         id: "{{ id }}"
  #         productName: "{{ productName }}"
  #         producer: "{{ producer }}"
  #         answeredQuestions: "{{ answeredQuestions }}"
  #         starPercentages: "{{ starPercentages }} "
  #         numberOfRatings: "{{ numberOfRatings }}"
  #         price: "{{ price }}"
  #         inStock: "{{ inStock }}"
  #         productInfo: "{{ productInfo }}"